Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ЗаданияНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаЗакупку</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаданияНаЗакупкиСтатусы</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Enums/СтатусыЗаданийНаЗакупку/СтатусыЗаданийНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаданийНаЗакупку</name>
  <enumValues>
    <name>ВыданоПодрядчику</name>
  </enumValues>
  <enumValues>
    <name>НаДоработке</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Выборка = Справочники.Подрядчик.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбораПодрядчика.Добавить(Выборка.Ссылка, Выборка.Ссылка);		
	КонецЦикла;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьЗаданияНаЗакупку(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗадниеНаЗакупку");	    
	ПараметрыОбъекта.Вставить("Подрядчик", Неопределено);	    	
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормыБСП 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)    
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);  
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры)

	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)   
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()   
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);   
	
КонецПроцедуры
#КонецОбласти


#Область ПрочиеПроцедурыИФункции
 
&НаСервереБезКонтекста
Функция СоздатьЗаданиеНаЗакупки(Подрядчик, МассивДанныхЗагрузкиТЧ) Экспорт
	
	НовоеЗадание                 = Документы.ЗаданияНаЗакупку.СоздатьДокумент();
	НовоеЗадание.Дата            = ТекущаяДатаСеанса();
	НовоеЗадание.СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику; 
	НовоеЗадание.Подрядчик       = Подрядчик;
	
	Для каждого ТекКабельнаяЛиния Из МассивДанныхЗагрузкиТЧ Цикл
		НовКабельнаяЛиния                = НовоеЗадание.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния = ТекКабельнаяЛиния.КабельнаяЛиния;     
		НовКабельнаяЛиния.ЖурналУчетаКП  = ТекКабельнаяЛиния.ЖурналУчетаКП;     		
		НовКабельнаяЛиния.Принято        = Истина;
	КонецЦикла;
	
	НовоеЗадание.Записать();
	
	Возврат НовоеЗадание.Ссылка; 
	
КонецФункции

#КонецОбласти
